Repository: grilocolportor/qrcode_magic
Catalog: lib/l10n/app_*.arb
Languages: pt

# appDescription
source: Generate and scan QRCodes easily!
pt: Gere e escaneie códigos QR facilmente!

# scanNew
source: Scan new QRCode
pt: Escanear um novo QRCode

# generateNew
source: Generate new QRCode
pt: Gerar um novo QRCode

# provideData
source: Provide the data to generate the QRCode
pt: Forneça a informação para gerar o QRCode

# exampleData
source: This text will generate a QRCode
pt: Esse texto gerará o QRCode

source: Generate
pt: Gerar

source: Share
pt: Compartilhar

source: Save
pt: Salvar

source: Size
pt: Tamanho

source: Rounded
pt: Arredondado

# imageSelect
source: Center image (optional)
pt: Imagem do centro (opcional)

# generatedQRObs
source: * The QRCode generated here will always be 230x230 px. When you export or save it, it will take the real size. Scroll down to see the buttons.
pt: * O QRCode mostrado aqui sempre terá 230x230 px. O tamanho escolhido por você será aplicado ao exportar ou salvar o QRCode! Role para baixo para ver os botões.

source: Click to select
pt: Clique para selecionar

# needProvideData
source: You need to provide the data!
pt: Você precisa fornecer o dado!

# allowManageFiles
source: You need to allow us to save QRCodes on your device!
pt: Você precisa permitir que salvemos o QRCode em seu dispositivo!

# allowCamera
source: You need to allow us to use your camera to scan QRCodes!
pt: Você precisa permitir que utilizemos sua câmera para podermos escanear QRCodes!

# qrSaved
source: QRCode saved to %file%!
pt: QRCode salvo em %file%!

# errorOccurred
source: An error occurred: %error%
pt: Ocorreu um erro: %error%

# pointCamera
source: Point your camera to a QRCode
pt: Aponte sua câmera para um QRCode

source: Result:
pt: Resultado:

source: waiting...
pt: aguardando...

source: Copy
pt: Copiar

source: Copied!
pt: Copiado!
